#coding:utf-8
def profits():
    a=float(input('please input profits:'))#输入转换为浮点数
    x=a/10000.  #python2注意使用浮点数，整数会忽略小数点，python3不会忽略
    if x>=100:
        print u'应发奖金总数:%s'%(((x-100)*0.01+(x-60)*0.015+(x-40)*0.03+(x-20)*0.05+((x-10)*0.075+10*0.1))*10000)
    elif x>=60:
        print u'应发奖金总数:%s'%(((x-60)*0.015+(x-40)*0.03+(x-20)*0.05+((x-10)*0.075+10*0.1))*10000)
    elif x>=40:
        print u'应发奖金总数:%s'%(((x-40)*0.03+(x-20)*0.05+((x-10)*0.075+10*0.1))*10000)
    elif x>=20:
        print u'应发奖金总数:%s'%(((x-20)*0.05+((x-10)*0.075+10*0.1))*10000)
    elif x>=10:
        print u'应发奖金总数:%s'%(((x-10)*0.075+10*0.1)*10000)
    elif x<10:
        print u'应发奖金总数:%s'%(x*0.1*10000)
    profits()#函数内调用自身，自调函数
profits()